Revit 2027 API
CircuitNamingSchemeSettings.CircuitNamingSchemeId Property
 The circuit naming scheme id set in CircuitNamingSchemeSettings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CircuitNamingSchemeId { get; set; }
Public Property CircuitNamingSchemeId As ElementId
	Get
	Set
public:
property ElementId^ CircuitNamingSchemeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member CircuitNamingSchemeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The circuit naming scheme id is invalid for the CircuitNamingSchemeSettings.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CircuitNamingSchemeSettings Class
Autodesk.Revit.DB.Electrical Namespace